In [289]:
%load_ext sql
%sql sqlite:///lab3-1.db3

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @lab3-1.db3'

# Q1: In the score table, find the student number that has all the grades in between 90 and 70.

In [290]:
# RETURNS SNO WHERE GRADES ARE BETWEEN 90 AND 70, INCLUSIVE

In [291]:
%%sql 
SELECT sno
FROM scores
WHERE (grade <= 90) AND (grade >= 70)

 * sqlite:///lab3-1.db3
Done.

[('103',),
 ('105',),
 ('105',),
 ('109',),
 ('108',),
 ('101',),
 ('107',),
 ('108',)]

# Q2: For all the courses that took by class 15033, calculate the average grade.

In [292]:
# RETURNS THE AVERAGE GRADE

In [293]:
%%sql
SELECT avg(grade)
FROM scores, students
WHERE students.class = 15033 AND students.sno = scores.sno

 * sqlite:///lab3-1.db3
Done.

[(79.66666666666667,)]

# Q3: Find the class number that has at least two male students.

In [294]:
# RETURN THE CLASS NUMBER

In [295]:
%%sql
SELECT s.class
FROM students s 
WHERE s.sgender = 'M'
GROUP BY s.class HAVING COUNT(*) >= 2

 * sqlite:///lab3-1.db3
Done.

[('15031',), ('15033',)]

# Q4: Find the teacher's name in CS and EE department, where they have different title.

In [296]:
# RETURN BOTH NAME AND TITLE
# FROM THE DATA PROVIDED, THERE IS NO TEACHER THAT FITS THE REQ.

In [297]:
%%sql
SELECT tname, title
FROM ( 
        SELECT *
        FROM teachers
        WHERE department = 'CS') NATURAL JOIN ( 
            SELECT tno, title as title2
            FROM teachers
            WHERE department = 'EE')
WHERE title != title2

 * sqlite:///lab3-1.db3
Done.

[]

# Q5: Find the students, who took the course number "3-105" and have earned a grade, at least, higher than the students who took "3-245" course.

In [298]:
# RETURNS SNO (PRIMARY KEY), STUDENT NAME, AND GRADE IN DESCENDING ORDER OF GRADE

In [299]:
%%sql
SELECT sno, sname, grade
FROM scores natural join students
WHERE  cno = '3-105' AND grade > (
                                     SELECT max(grade)
                                     FROM scores
                                     WHERE cno = '3-245' )
ORDER BY grade DESC

 * sqlite:///lab3-1.db3
Done.

[('103', 'Quincy', 92), ('107', 'Lily', 91), ('105', 'Gary', 88)]

# Q6: Find the students, who took more than 1 course, and return the students' names that is not the one with highest grade.

In [300]:
# RETURNS STUDENT NAMES WHO TOOK MORE THAN 1 COURSE
# EXCEPT THE STUDENT WHO HAD THE HIGHEST GRADE
# IN THIS DB, SNO = 103 HAD THE HIGHEST SCORE

In [301]:
%%sql
SELECT s.sno
FROM scores s, students t
WHERE t.sno = s.sno
GROUP BY s.sno HAVING count(*)>1 AND s.grade <>( SELECT max(grade) 
                                                 FROM scores )

 * sqlite:///lab3-1.db3
Done.

[('101',), ('105',), ('107',), ('108',), ('109',)]

# Q7: For each course, find the students who earned a grade less than the average grade of this course.

In [302]:
# RETURNS SNO OF STUDENT
# CREATE NESTED LIST TO FIND GRADE LESS THAN AVERAGE
# THEN GROUP BY CNO

In [303]:
%%sql
SELECT sno, cno
FROM scores
WHERE grade < ( SELECT avg(grade)
                FROM scores
                GROUP BY cno )
GROUP BY cno

 * sqlite:///lab3-1.db3
Done.

[('109', '3-105'), ('105', '3-245'), ('107', '6-106'), ('108', '6-166')]